-- 우리 db에 맞게 필드 수정함 (2025.12.17)

-- 학생
INSERT INTO student (id, name, birth_date, gender, address, tel, email, department_id, grade, semester, entrance_date)
VALUES
    (2022000001,'전민우', '2001-06-19', '남성', '부산시 남구', '010-5267-1815', 'jmw@green.com', 101, 1, 1, '2024-03-02'),
    (2022000002,'민민서', '2001-06-19', '여성', '부산시 남구', '010-5267-1815', 'mms@green.com', 101, 1, 1, '2024-03-02'),
    (2023000001,'박시우', '2002-06-19', '남성', '부산시 남구', '010-5267-1815', 'psw@green.com', 101, 1, 1, '2025-03-02'),
    (2023000002,'김예준', '2002-04-25', '남성', '부산시 북구', '010-4152-9963', 'kyj@green.com', 101, 1, 1, '2025-03-02'),
    (2023000003,'김지우', '2002-11-15', '여성', '부산시 해운대구', '010-1526-8495', 'kjw@green.com', 101, 1, 1, '2025-03-02'),
    (2023000004,'정수호', '2003-01-14', '남성', '부산시 북구', '010-2481-7553', 'jsh@green.com', 101, 1, 1, '2025-03-02'),
    (2023000005,'김주원', '2003-06-19', '남성', '부산시 동구', '010-1052-4486', 'kjw2@green.com', 101, 1, 1, '2025-03-02'),
    (2023000006,'이민서', '2003-12-29', '여성', '부산시 해운대구', '010-1096-7741', 'lms2@green.com', 101, 1, 1, '2025-03-02'),
    (2023000007,'문건우', '2003-07-22', '남성', '부산시 해운대구', '010-0326-0926', 'mgw@green.com', 101, 1, 1, '2025-03-02'),
    (2023000008,'정민준', '2004-06-02', '남성', '부산시 사하구', '010-0096-8196', 'jmj@green.com', 101, 1, 1, '2025-03-02'),
    (2023000009,'전하은', '2003-04-28', '여성', '부산시 사하구', '010-7158-8852', 'jhe@green.com', 101, 1, 1, '2025-03-02'),
    (2023000010,'김도현', '2003-09-29', '남성', '부산시 영도구', '010-1234-8592', 'kdh2@green.com', 101, 1, 1, '2025-03-02');

INSERT INTO student (id, name, birth_date, gender, address, tel, email, department_id, grade, semester, entrance_date)
VALUES
    (2023000011,'차은우', '2002-07-04', '남성', '부산시 남구', '010-5267-0106', 'cew@green.com', 102, 1, 1, '2025-03-02'),
    (2023000012, '박서준', '2002-04-26', '남성', '부산시 북구', '010-4152-9148', 'psj@green.com', 102, 1, 1, '2025-03-02'),
    (2023000013,'이도윤', '2002-11-22', '남성', '부산시 해운대구', '010-1526-9962', 'ldw@green.com', 102, 1, 1, '2025-03-02'),
    (2023000014,'강민지', '2003-01-01', '여성', '부산시 북구', '010-2481-7718', 'kmj11@green.com', 102, 1, 1, '2025-03-02'),
    (2023000015,'윤진희', '2003-06-29', '여성', '부산시 동구', '010-1052-1014', 'yjh@green.com', 102, 1, 1, '2025-03-02'),
    (2023000016,'김유준', '2003-12-30', '남성', '부산시 해운대구', '010-1096-0205', 'kyj09@green.com', 102, 1, 1, '2025-03-02'),
    (2023000017,'이준우', '2003-07-11', '남성', '부산시 해운대구', '010-0326-7085', 'ljw@green.com', 102, 1, 1, '2025-03-02'),
    (2023000018,'박연우', '2004-06-17', '남성', '부산시 사하구', '010-0096-1164', 'pyw@green.com', 102, 1, 1, '2025-03-02'),
    (2023000019,'이윤서', '2003-04-03', '여성', '부산시 사하구', '010-7158-1992', 'lys08@green.com', 102, 1, 1, '2025-03-02'),
    (2023000020,'신하윤', '2003-09-01', '여성', '부산시 영도구', '010-1234-4052', 'shy@green.com', 102, 1, 1, '2025-03-02');

INSERT INTO student (id, name, birth_date, gender, address, tel, email, department_id, grade, semester, entrance_date)
VALUES
    (2023000021,'김현민', '2002-01-04', '남성', '부산시 남구', '010-4165-0106', 'khm@green.com', 103, 2, 1, '2024-03-02'),
    (2023000022,'하준서', '2002-01-26', '남성', '부산시 북구', '010-1152-9148', 'hjs@green.com', 103, 2, 1, '2024-03-02'),
    (2023000023,'김우진', '2002-02-22', '남성', '부산시 해운대구', '010-8295-9962', 'kwj@green.com', 103, 2, 1, '2024-03-02'),
    (2023000024,'김예나', '2003-11-01', '여성', '부산시 북구', '010-8844-7718', 'kyn@green.com', 103, 2, 1, '2024-03-02'),
    (2023000025,'윤태리', '2003-12-29', '여성', '부산시 동구', '010-7154-1014', 'ytr@green.com', 103, 2, 1, '2024-03-02'),
    (2023000026,'이민재', '2003-09-30', '남성', '부산시 해운대구', '010-1693-0205', 'lmj87@green.com', 103, 2, 1, '2024-03-02'),
    (2023000027,'정현준', '2003-05-11', '남성', '부산시 해운대구', '010-2356-7085', 'jhj2@green.com', 103, 2, 1, '2024-03-02'),
    (2023000028,'정지호', '2004-05-17', '남성', '부산시 사하구', '010-8520-1164', 'jjh@green.com', 103, 2, 1, '2024-03-02'),
    (2023000029,'이수아', '2003-02-03', '여성', '부산시 사하구', '010-0215-1992', 'lsa@green.com', 103, 2, 1, '2024-03-02'),
    (2023000030,'김채원', '2003-08-01', '여성', '부산시 영도구', '010-0369-4052', 'kcw@green.com', 103, 2, 1, '2024-03-02');

INSERT INTO student (id, name, birth_date, gender, address, tel, email, department_id, grade, semester, entrance_date)
VALUES
    (2023000031,'이지후', '2002-01-10', '남성', '부산시 남구', '010-2623-0106', 'ljh@green.com', 104, 3, 2, '2023-03-02'),
    (2023000032,'윤정우', '2002-01-11', '남성', '부산시 북구', '010-1152-1625', 'yjw@green.com', 104, 3, 2, '2023-03-02'),
    (2023000033,'김시윤', '2002-02-24', '남성', '부산시 해운대구', '010-1195-9962', 'ksy3@green.com', 104, 3, 2, '2023-03-02'),
    (2023000034,'최서연', '2003-11-14', '여성', '부산시 북구', '010-8844-4185', 'csy@green.com', 104, 3, 2, '2023-03-02'),
    (2023000035,'임지유', '2003-12-27', '여성', '부산시 동구', '010-7154-1166', 'lju@green.com', 104, 3, 2, '2023-03-02'),
    (2023000036,'김유찬', '2003-09-02', '남성', '부산시 해운대구', '010-1748-0205', 'kyc@green.com', 104, 3, 2, '2023-03-02'),
    (2023000037,'하준영', '2003-05-01', '남성', '부산시 해운대구', '010-2356-1234', 'hjw2@green.com', 104, 3, 2, '2023-03-02'),
    (2023000038,'차지원', '2004-05-19', '남성', '부산시 사하구', '010-1928-1164', 'cjw9@green.com', 104, 3, 2, '2023-03-02'),
    (2023000039,'이다인', '2003-02-14', '여성', '부산시 사하구', '010-0215-1614', 'ldi@green.com', 104, 3, 2, '2023-03-02'),
    (2023000040,'김아린', '2003-08-24', '여성', '부산시 영도구', '010-0042-4052', 'kar@green.com', 104, 3, 2, '2023-03-02');

INSERT INTO student (id, name, birth_date, gender, address, tel, email, department_id, grade, semester, entrance_date)
VALUES
    (2023000041,'정윤호', '2002-07-10', '남성', '부산시 남구', '010-1235-8495', 'jyh@green.com', 105, 2, 1, '2024-03-02'),
    (2023000042,'이태윤', '2002-11-11', '남성', '부산시 북구', '010-1624-1625', 'lty@green.com', 105, 2, 1, '2024-03-02'),
    (2023000043,'이재민', '2002-06-24', '남성', '부산시 해운대구', '010-1162-9962', 'ljm@green.com', 105, 2, 1, '2024-03-02'),
    (2023000044,'박시연', '2003-08-14', '여성', '부산시 북구', '010-8844-1948', 'psy@green.com', 105, 2, 1, '2024-03-02'),
    (2023000045,'정나윤', '2003-01-27', '여성', '부산시 동구', '010-7154-1245', 'jny@green.com', 105, 2, 1, '2024-03-02'),
    (2023000046,'하준호', '2003-05-02', '남성', '부산시 해운대구', '010-1748-7548', 'hjh3@green.com', 105, 2, 1, '2024-03-02'),
    (2023000047,'김나은', '2003-04-01', '남성', '부산시 해운대구', '010-2356-7410', 'kne@green.com', 105, 2, 2, '2024-03-02'),
    (2023000048,'이한결', '2004-07-19', '남성', '부산시 사하구', '010-1928-0104', 'lhg@green.com', 105, 2, 2, '2024-03-02'),
    (2023000049,'김서진', '2003-04-14', '여성', '부산시 사하구', '010-0215-0062', 'ksj12@green.com', 105, 2, 2, '2024-03-02'),
    (2023000050,'김다빈', '2003-09-24', '여성', '부산시 영도구', '010-0042-4015', 'kdb@green.com', 105, 2, 2, '2024-03-02');

INSERT INTO student (id, name, birth_date, gender, address, tel, email, department_id, grade, semester, entrance_date, graduation_date)
VALUES
    (2023000051, '김민지', '2004-01-01', '여성', '부산시 기장군', '010-3423-0355', 'alswl@naver.com', 106, 1, 1, '2025-03-02', NULL),
    (2023000052, '임소연', '2004-04-01', '여성', '부산시 기장군', '010-2344-0452', 'thdus@naver.com', 106, 1, 1, '2025-03-02', NULL),
    (2023000053, '최지혜', '2004-06-02', '여성', '부산시 기장군', '010-6564-6370', 'wlgp@naver.com', 106, 1, 1, '2025-03-02', NULL),
    (2023000054, '이서연', '2004-02-03', '여성', '부산시 기장군', '010-2325-1305', 'tjdus@naver.com', 106, 1, 1, '2025-03-02', NULL),
    (2023000055, '노휘정', '2004-07-06', '여성', '부산시 기장군', '010-5445-3562', 'gnlwjd@naver.com', 106, 1, 1, '2025-03-02', NULL),
    (2023000056, '서지혜', '2004-12-08', '여성', '부산시 기장군', '010-6654-8865', 'wlgptj@naver.com', 106, 1, 1, '2025-03-02', NULL),
    (2023000057, '김한솔', '2004-11-07', '여성', '부산시 기장군', '010-7867-8768', 'gksthf@naver.com', 106, 1, 1, '2025-03-02', NULL),
    (2023000058, '백선우', '2004-10-10', '여성', '부산시 기장군', '010-5465-9975', 'tjsdn@naver.com', 106, 1, 1, '2025-03-02', NULL),
    (2023000059, '권희진', '2004-05-10', '여성', '부산시 기장군', '010-7676-7478', 'gmlwls@naver.com', 106, 1, 1, '2025-03-02', NULL),
    (2023000060, '백수민', '2004-07-12', '여성', '부산시 기장군', '010-5424-2596', 'tnals@naver.com', 106, 1, 1, '2025-03-02', NULL),
    (2023000061, '최성민', '2004-04-12', '여성', '부산시 기장군', '010-4534-4563', 'tjdals@naver.com', 107, 1, 2, '2025-03-02', NULL),
    (2023000062, '이윤정', '2004-09-14', '여성', '부산시 기장군', '010-3247-9784', 'dbswjd@naver.com', 107, 1, 2, '2025-03-02', NULL),
    (2023000063, '배수연', '2004-10-19', '여성', '부산시 기장군', '010-8965-4564', 'tndus@naver.com', 107, 1, 2, '2025-03-02', NULL),
    (2023000064, '강윤지', '2004-10-17', '여성', '부산시 기장군', '010-3453-6775', 'dbswl@naver.com', 107, 1, 2, '2025-03-02', NULL),
    (2023000065, '김예빈', '2004-12-15', '여성', '부산시 기장군', '010-4432-2234', 'dpqls@naver.com', 107, 1, 2, '2025-03-02', NULL),
    (2023000066, '김하정', '2004-11-14', '여성', '부산시 기장군', '010-8778-5452', 'gkwjd@naver.com', 107, 1, 2, '2025-03-02', NULL),
    (2023000067, '김지원', '2004-11-12', '여성', '부산시 기장군', '010-5464-4311', 'wldnjs@naver.com', 107, 1, 2, '2025-03-02', NULL),
    (2023000068, '김현아', '2004-06-12', '여성', '부산시 기장군', '010-2346-3423', 'gusdk@naver.com', 107, 1, 2, '2025-03-02', NULL),
    (2023000069, '박수현', '2004-07-03', '여성', '부산시 기장군', '010-8644-5634', 'tngus@naver.com', 107, 1, 2, '2025-03-02', NULL),
    (2023000070, '송민정', '2004-08-05', '여성', '부산시 기장군', '010-5453-2354', 'alswjd@naver.com', 107, 1, 2, '2025-03-02', NULL),
    (2023000071, '우해인', '2004-05-06', '여성', '부산시 기장군', '010-8675-4653', 'godls@naver.com', 108, 1, 1, '2025-03-02', NULL),
    (2023000072, '엄세희', '2004-03-05', '여성', '부산시 기장군', '010-4364-2456', 'tpgml@naver.com', 108, 1, 1, '2025-03-02', NULL),
    (2023000073, '이선아', '2004-02-02', '여성', '부산시 기장군', '010-4654-2357', 'tjsdk@naver.com', 108, 1, 1, '2025-03-02', NULL),
    (2023000074, '이효주', '2004-01-21', '여성', '부산시 기장군', '010-8678-2955', 'gywn@naver.com', 108, 1, 1, '2025-03-02', NULL),
    (2023000075, '임희영', '2004-01-24', '여성', '부산시 기장군', '010-9865-2346', 'gmldud@naver.com', 108, 1, 1, '2025-03-02', NULL),
    (2023000076, '김기범', '2004-05-19', '남성', '부산시 기장군', '010-3246-7537', 'rlqja@naver.com', 108, 1, 1, '2025-03-02', NULL),
    (2023000077, '이태형', '2004-08-18', '남성', '부산시 기장군', '010-5442-2423', 'xogud@naver.com', 108, 1, 1, '2025-03-02', NULL),
    (2023000078, '김민철', '2004-07-16', '남성', '부산시 기장군', '010-3245-3523', 'alscjf@naver.com', 108, 1, 1, '2025-03-02', NULL),
    (2023000079, '김준우', '2004-06-15', '남성', '부산시 기장군', '010-5435-3546', 'wnsdn@naver.com', 108, 1, 1, '2025-03-02', NULL),
    (2023000080, '류영환', '2004-09-12', '남성', '부산시 기장군', '010-6546-2345', 'dudghks@naver.com', 108, 1, 1, '2025-03-02', NULL),
    (2023000081, '박건현', '2004-10-23', '남성', '부산시 기장군', '010-4634-6734', 'rjsgus@naver.com', 109, 1, 2, '2025-03-02', NULL),
    (2023000082, '박명찬', '2004-10-23', '남성', '부산시 기장군', '010-3434-7854', 'audcks@naver.com', 109, 1, 2, '2025-03-02', NULL),
    (2023000083, '박세원', '2004-05-27', '남성', '부산시 기장군', '010-4367-4356', 'tpdnjs@naver.com', 109, 1, 2, '2025-03-02', NULL),
    (2023000084, '박수현', '2004-05-26', '남성', '부산시 기장군', '010-7564-9663', 'tngus@naver.com', 109, 1, 2, '2025-03-02', NULL),
    (2023000085, '박재현', '2004-05-24', '남성', '부산시 기장군', '010-6988-5783', 'wogus@naver.com', 109, 1, 2, '2025-03-02', NULL),
    (2023000086, '박태호', '2004-03-20', '남성', '부산시 기장군', '010-7634-8563', 'xogh33@naver.com', 109, 1, 2, '2025-03-02', NULL),
    (2023000087, '배용진', '2004-02-10', '남성', '부산시 기장군', '010-4535-7567', 'dydwls@naver.com', 109, 1, 2, '2025-03-02', NULL),
    (2023000088, '서재영', '2004-01-13', '남성', '부산시 기장군', '010-6754-6573', 'wodud@naver.com', 109, 1, 2, '2025-03-02', NULL),
    (2023000089, '성윤석', '2004-05-11', '남성', '부산시 기장군', '010-6545-3456', 'dbstjr@naver.com', 109, 1, 2, '2025-03-02', NULL),
    (2023000090, '소제웅', '2004-07-17', '남성', '부산시 기장군', '010-4654-8645', 'wpdnd@naver.com', 109, 1, 2, '2025-03-02', NULL),
    (2023000091, '손휘준', '2004-06-15', '남성', '부산시 기장군', '010-6547-6772', 'gnlwns@naver.com', 110, 1, 1, '2025-03-02', NULL),
    (2023000092, '신종민', '2004-08-15', '남성', '부산시 기장군', '010-4536-8862', 'whdals@naver.com', 110, 1, 1, '2025-03-02', NULL),
    (2023000093, '안지훈', '2004-05-11', '남성', '부산시 기장군', '010-7634-7743', 'wlgns@naver.com', 110, 1, 1, '2025-03-02', NULL),
    (2023000094, '이건민', '2004-05-05', '남성', '부산시 기장군', '010-2323-5536', 'rjsals@naver.com', 110, 1, 1, '2025-03-02', NULL),
    (2023000095, '이경섭', '2004-04-21', '남성', '부산시 기장군', '010-4323-1127', 'rudtjq@naver.com', 110, 1, 1, '2025-03-02', NULL),
    (2023000096, '이병권', '2004-02-22', '남성', '부산시 기장군', '010-3242-1235', 'qudrnjs@naver.com', 110, 1, 1, '2025-03-02', NULL),
    (2023000097, '이연수', '2004-05-23', '남성', '부산시 기장군', '010-2323-1331', 'dustn@naver.com', 110, 1, 1, '2025-03-02', NULL),
    (2023000098, '이인기', '2004-10-23', '남성', '부산시 기장군', '010-4374-4573', 'dlsrl@naver.com', 110, 1, 1, '2025-03-02', NULL),
    (2023000099, '이장혁', '2004-12-23', '남성', '부산시 기장군', '010-8754-8657', 'wkdgur@naver.com', 110, 1, 1, '2025-03-02', NULL),
    (2023000100, '정재민', '2004-12-23', '남성', '부산시 기장군', '010-2346-8867', 'woals@naver.com', 110, 1, 1, '2025-03-02', NULL);


INSERT INTO user (id, password, user_role)
VALUES
    (2022000001, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2022000002, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000001, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000002, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000003, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000004, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000005, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000006, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000007, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000008, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000009, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000010, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000011, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000012, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000013, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000014, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000015, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000016, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000017, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000018, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000019, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000020, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000021, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000022, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000023, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000024, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000025, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000026, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000027, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000028, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000029, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000030, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000031, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000032, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000033, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000034, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000035, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000036, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000037, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000038, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000039, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000040, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000041, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000042, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000043, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000044, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000045, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000046, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000047, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000048, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000049, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000050, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student');

INSERT INTO user (id, password, user_role)
VALUES
    (2023000051, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000052, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000053, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000054, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000055, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000056, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000057, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000058, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000059, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000060, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000061, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000062, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000063, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000064, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000065, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000066, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000067, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000068, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000069, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000070, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000071, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000072, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000073, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000074, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000075, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000076, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000077, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000078, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000079, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000080, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000081, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000082, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000083, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000084, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000085, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000086, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000087, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000088, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000089, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000090, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000091, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000092, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000093, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000094, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000095, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000096, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000097, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000098, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000099, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student'),
    (2023000100, '$2a$10$FhWCqhZC.zTPpVbRO6WeweMcDx5J56Y0nEB0btTRbon2.g4aY5lPu', 'student');


-- 재학
INSERT INTO stu_stat (student_id, status, from_date, to_date)
VALUES
    (2022000001, '재학', '2025-03-02', '9999-01-01'),
    (2022000002, '재학', '2025-03-02', '9999-01-01'),
    (2023000001, '재학', '2025-03-02', '9999-01-01'),
    (2023000002, '재학', '2025-03-02', '9999-01-01'),
    (2023000003, '재학', '2025-03-02', '9999-01-01'),
    (2023000004, '재학', '2025-03-02', '9999-01-01'),
    (2023000005, '재학', '2025-03-02', '9999-01-01'),
    (2023000006, '재학', '2025-03-02', '9999-01-01'),
    (2023000007, '재학', '2025-03-02', '9999-01-01'),
    (2023000008, '재학', '2025-03-02', '9999-01-01'),
    (2023000009, '재학', '2025-03-02', '9999-01-01'),
    (2023000010, '재학', '2025-03-02', '9999-01-01'),
    (2023000011, '재학', '2025-03-02', '9999-01-01'),
    (2023000012, '재학', '2025-03-02', '9999-01-01'),
    (2023000013, '재학', '2025-03-02', '9999-01-01'),
    (2023000014, '재학', '2025-03-02', '9999-01-01'),
    (2023000015, '재학', '2025-03-02', '9999-01-01'),
    (2023000016, '재학', '2025-03-02', '9999-01-01'),
    (2023000017, '재학', '2025-03-02', '9999-01-01'),
    (2023000018, '재학', '2025-03-02', '9999-01-01'),
    (2023000019, '재학', '2025-03-02', '9999-01-01'),
    (2023000020, '재학', '2025-03-02', '9999-01-01'),
    (2023000021, '재학', '2024-03-02', '9999-01-01'),
    (2023000022, '재학', '2024-03-02', '9999-01-01'),
    (2023000023, '재학', '2024-03-02', '9999-01-01'),
    (2023000024, '재학', '2024-03-02', '9999-01-01'),
    (2023000025, '재학', '2024-03-02', '9999-01-01'),
    (2023000026, '재학', '2024-03-02', '9999-01-01'),
    (2023000027, '재학', '2024-03-02', '9999-01-01'),
    (2023000028, '재학', '2024-03-02', '9999-01-01'),
    (2023000029, '재학', '2024-03-02', '9999-01-01'),
    (2023000030, '재학', '2024-03-02', '9999-01-01'),
    (2023000031, '재학', '2023-03-02', '9999-01-01'),
    (2023000032, '재학', '2023-03-02', '9999-01-01'),
    (2023000033, '재학', '2023-03-02', '9999-01-01'),
    (2023000034, '재학', '2023-03-02', '9999-01-01'),
    (2023000035, '재학', '2023-03-02', '9999-01-01'),
    (2023000036, '재학', '2023-03-02', '9999-01-01'),
    (2023000037, '재학', '2023-03-02', '9999-01-01'),
    (2023000038, '재학', '2023-03-02', '9999-01-01'),
    (2023000039, '재학', '2023-03-02', '9999-01-01'),
    (2023000040, '재학', '2023-03-02', '9999-01-01'),
    (2023000041, '재학', '2024-03-02', '9999-01-01'),
    (2023000042, '재학', '2024-03-02', '9999-01-01'),
    (2023000043, '재학', '2024-03-02', '9999-01-01'),
    (2023000044, '재학', '2024-03-02', '9999-01-01'),
    (2023000045, '재학', '2024-03-02', '9999-01-01'),
    (2023000046, '재학', '2024-03-02', '9999-01-01'),
    (2023000047, '재학', '2024-03-02', '9999-01-01'),
    (2023000048, '재학', '2024-03-02', '9999-01-01'),
    (2023000049, '재학', '2024-03-02', '9999-01-01'),
    (2023000050, '재학', '2024-03-02', '9999-01-01');

INSERT INTO stu_stat (student_id, status, from_date, to_date)
VALUES
    (2023000051, '재학', '2025-03-02', '9999-01-01'),
    (2023000052, '재학', '2025-03-02', '9999-01-01'),
    (2023000053, '재학', '2025-03-02', '9999-01-01'),
    (2023000054, '재학', '2025-03-02', '9999-01-01'),
    (2023000055, '재학', '2025-03-02', '9999-01-01'),
    (2023000056, '재학', '2025-03-02', '9999-01-01'),
    (2023000057, '재학', '2025-03-02', '9999-01-01'),
    (2023000058, '재학', '2025-03-02', '9999-01-01'),
    (2023000059, '재학', '2025-03-02', '9999-01-01'),
    (2023000060, '재학', '2025-03-02', '9999-01-01'),
    (2023000061, '재학', '2025-03-02', '9999-01-01'),
    (2023000062, '재학', '2025-03-02', '9999-01-01'),
    (2023000063, '재학', '2025-03-02', '9999-01-01'),
    (2023000064, '재학', '2025-03-02', '9999-01-01'),
    (2023000065, '재학', '2025-03-02', '9999-01-01'),
    (2023000066, '재학', '2025-03-02', '9999-01-01'),
    (2023000067, '재학', '2025-03-02', '9999-01-01'),
    (2023000068, '재학', '2025-03-02', '9999-01-01'),
    (2023000069, '재학', '2025-03-02', '9999-01-01'),
    (2023000070, '재학', '2025-03-02', '9999-01-01'),
    (2023000071, '재학', '2025-03-02', '9999-01-01'),
    (2023000072, '재학', '2025-03-02', '9999-01-01'),
    (2023000073, '재학', '2025-03-02', '9999-01-01'),
    (2023000074, '재학', '2025-03-02', '9999-01-01'),
    (2023000075, '재학', '2025-03-02', '9999-01-01'),
    (2023000076, '재학', '2025-03-02', '9999-01-01'),
    (2023000077, '재학', '2025-03-02', '9999-01-01'),
    (2023000078, '재학', '2025-03-02', '9999-01-01'),
    (2023000079, '재학', '2025-03-02', '9999-01-01'),
    (2023000080, '재학', '2025-03-02', '9999-01-01'),
    (2023000081, '재학', '2025-03-02', '9999-01-01'),
    (2023000082, '재학', '2025-03-02', '9999-01-01'),
    (2023000083, '재학', '2025-03-02', '9999-01-01'),
    (2023000084, '재학', '2025-03-02', '9999-01-01'),
    (2023000085, '재학', '2025-03-02', '9999-01-01'),
    (2023000086, '재학', '2025-03-02', '9999-01-01'),
    (2023000087, '재학', '2025-03-02', '9999-01-01'),
    (2023000088, '재학', '2025-03-02', '9999-01-01'),
    (2023000089, '재학', '2025-03-02', '9999-01-01'),
    (2023000090, '재학', '2025-03-02', '9999-01-01'),
    (2023000091, '재학', '2025-03-02', '9999-01-01'),
    (2023000092, '재학', '2025-03-02', '9999-01-01'),
    (2023000093, '재학', '2025-03-02', '9999-01-01'),
    (2023000094, '재학', '2025-03-02', '9999-01-01'),
    (2023000095, '재학', '2025-03-02', '9999-01-01'),
    (2023000096, '재학', '2025-03-02', '9999-01-01'),
    (2023000097, '재학', '2025-03-02', '9999-01-01'),
    (2023000098, '재학', '2025-03-02', '9999-01-01'),
    (2023000099, '재학', '2025-03-02', '9999-01-01'),
    (2023000100, '재학', '2025-03-02', '9999-01-01');


-- 학사일정
INSERT INTO schedule
(id, staff_id, start_day, end_day, information)
VALUES
    (1,230001, '2025-01-27', '2025-02-01', '2025-1학기 예비수강신청'),
    (2,230001, '2025-02-13', '2025-02-17', '2025-1학기 수강신청'),
    (3,230001, '2025-02-17', '2025-02-23', '2025-1학기 등록'),
    (4,230001, '2025-02-22', '2025-02-22', '복학 접수 마감'),
    (5,230001, '2025-02-26', '2025-02-26', '졸업예배'),
    (6,230001, '2025-02-27', '2025-02-27', '학위수여식'),
    (7,230001, '2025-03-01', '2025-03-01', '삼일절'),
    (8,230001, '2025-03-02', '2025-03-02', '개강/교무위원회'),
    (9,230001, '2025-03-06', '2025-03-08', '수강신청 확인 및 변경'),
    (10,230001, '2025-03-10', '2025-03-13', '2025-1학기 추가등록'),
    (11,230001, '2025-12-13', '2025-12-17', '조기졸업 신청'),
    (12,230001, '2025-12-15', '2025-12-15', '미등록자 일반 휴학 접수 마감/ 등록금 전액반환 마감');

-- 공지사항
INSERT INTO notice (id, category, title, content, views, created_time)
VALUES
    (1, '[학사]', '2025학년도 1학기 학생예비군 전입 신고 안내',
     '2025학년도 1학기 학생예비군 전입신고를 아래와 같이 안내하오니 대상자는 전원 기간내에 신고하여 주시기 바랍니다.<br>
      <br>
      4. 행정사항<br>
         다. 대학 예비군훈련<br>
            1) 인사캠 : 5.1~5.4 / 4일, 교현예비군 훈련장(노고산 예비군 훈련대)<br>
            2) 자과캠 : 5.9~5.12 / 4일, 수원ㆍ화성ㆍ오산 과학화예비군훈련장(화성시 비봉면)<br>
           ※ 훈련 관련 세부적인 사항은 학교 및 예비군 홈페이지 공지(예정)<br>
         라. GLS 미 입력 및 기간이 경과한 인원은 예비군연대 방문(유선) 예비군 편입신청서 작성 제출', 12, (current_timestamp)),

    (2, '[장학]', '2025학년도 보건장학회 연구지원장학생 선발 안내',
     '1. 지원 요건<br>
      -국내에 소재한 보건분야의 대학,연구소 등에서 보건관련 연구를 계획하고 있는 자로서 소속학교장 이 다음의 사항에 의거하여 추천한 자<br>
      <br>
      5. 장학금 수여식: 8월 중 예정<br>
      -장학금 수여식에 초대받은 장학생은 참석을 원칙으로 함<br>', 5, (current_timestamp)),

    (3, '[일반]', 'Gartner Research(IT 분야 시장분석) 서비스 지원 안내',
     '기술사업화센터에서는 교내 구성원들의 연구에 도움을 드리고자 Gartner Research 서비스를 지원합니다.<br>
     Gartner는 미국의 시장조사 및 컨설팅 회사로서, 전 세계의 정부기관, 다국적 IT 기업 및 투자 회사 등 다양한 고객을 대상으로 신뢰도 높은 IT 분야 연구 및 시장 분석 보고서를 제공합니다.<br>
     교내 구성원들의 많은 관심과 이용 바랍니다.<br>', 7, (current_timestamp)),

    (4, '[일반]', '2025학년도 장애 인식개선 교육(법정의무교육) 안내',
     '장애학생지원센터에서는 「장애인복지법」 제 25조 및 「장애인고용촉진 및 직업재활법」제5조의2에 의거하여 장애인식개선 교육을 실시합니다.<br>
     본 교육은 보건복지부 교육 관리, 대학정보공시와 교육부 감사 등에서 이수 현황이 점검되고 있사오니, 본교의 구성원 여러분들의 적극적인 참여를 부탁드립니다.<br>
      <br>
      라. 수강 방법: 온라인 교육<br>
      <br>
      마. 포털 내 교육 이수 확인', 11, (current_timestamp)),

    (5, '[일반]', '2025학년도 1학기 코로나 19 특별휴학 시행 안내',
     '2025학년도 1학기 코로나19 특별휴학을 아래와 같이 한시적으로 시행하고자 합니다.<br>
      ※ 코로나19 관련 사유로 인해 학업을 시작, 지속할 수 없는 경우에 한하여 심의 및 승인을 거쳐 적용<br>
       <br>
       3. 신청서류 <br>
          가. 특별 휴학원서<br>
          나. 지도교수 확인서<br>
          다. 등록금 환불 신청서 _ 학생 계좌번호 필히 등록<br>
          라. 교환학생 확인서(해당자만)<br>
          마. 코로나19 확진자 중 후유증 · 합병증 발병자에 해당하는 경우 학사운영규정 제25조 및 제30조에 따른 증빙서류​<br>
          바. 기타 대학 행정실 및 본부에서 코로나 특별휴학 대상 여부 확인을 위해 요청하는 서류<br>
     ', 7, (current_timestamp)),

    (6, '[장학]', '2025학년도 교외장학재단 신규장학생 선발 결과 안내',
     ' ※ 장학금 공지에 올라온 학교지원 교외장학재단만 해당<br>
      ※ 각 심사 단계마다 합격자에 한하여 문자 발송<br>
      ※ 심사 단계 : 접수 중 -> 서류심사 중 -> 면접심사 중 -> 최종선발<br>
      ※ 완료된 심사 단계만 업데이트 됨<br>
      <br>
      ○ 2025학년도 1학기<br>
        - 관정이종환교육재단 : 접수중 - 서류심사중 - 면접심사중 - 최종선발 <br>
        - 보담장학회 : 접수중 - 서류심사중 - 최종선발 <br>
        - 김희경유럽정신문화장학재단 : 접수중 - 서류심사중 - 최종선발 <br>
        - 양천장학회 : 접수중 - 서류심사중 - 면접심사중  - 최종선발<br>', 13, (current_timestamp));

-- 교수 이름 채우기
UPDATE user u
    JOIN professor p ON u.id = p.id
    SET u.name = p.name
WHERE u.user_role = 'professor';

-- 학생 이름 채우기
UPDATE user u
    JOIN student s ON u.id = s.id
    SET u.name = s.name
WHERE u.user_role = 'student';

-- 교직원 이름 채우기
UPDATE user u
    JOIN staff st ON u.id = st.id
    SET u.name = st.name
WHERE u.user_role = 'staff';